$(function ($) {
    let M_1_25_i, M_0_315_i, M_0_071_i, M_1_25_2_i, M_0_315_2_i, M_0_071_2_i, M_1_25, M_0_315, M_0_071, MC_1_25,
        MC_0_315, MC_0_071, MC125, MC125_2, MC0315, MC0315_2, MC0071, MC0071_2;

    function roundPlus(x, n) {
        if (isNaN(x) || isNaN(n)) return false;
        let m = Math.pow(10, n);
        return Math.round(x * m) / m;
    }

    $('#calc').on('click', function () {

        function calcA(m_i, m, size, trial = "_2") {

            let a = roundPlus(((m_i / m) * 100), 2);
            let prefix = '';

            if (size === "Мельче 1.25") {
                prefix = "_1_25" + trial;
            }
            if (size === "Мельче 0.315") {
                prefix = "_0_315" + trial;
            }
            if (size === "Мельче 0.071") {
                prefix = "_0_071" + trial;
            }

            $(`[name='a${prefix}']`).val(a);

            return a;
        }

        M_1_25_i = calcA($("[name='m_1_25']").val(), $("[name='m_1_1_25']").val(), "Мельче 1.25", "");
        M_0_315_i = calcA($("[name='m_0_315']").val(), $("[name='m_1_0_315']").val(), "Мельче 0.315", "");
        M_0_071_i = calcA($("[name='m_0_071']").val(), $("[name='m_1_0_071']").val(), "Мельче 0.071", "");

        M_1_25_2_i = calcA($("[name='m_1_25_2']").val(), $("[name='m_1_1_25_2']").val(), "Мельче 1.25");
        M_0_315_2_i = calcA($("[name='m_0_315_2']").val(), $("[name='m_1_0_315_2']").val(), "Мельче 0.315");
        M_0_071_2_i = calcA($("[name='m_0_071_2']").val(), $("[name='m_1_0_071_2']").val(), "Мельче 0.071");

        M_1_25 = roundPlus(((M_1_25_i + M_1_25_2_i) / 2), 2);
        MC_1_25 = roundPlus((100 - M_1_25), 2);
        $("[name='p_1_25']").val(MC_1_25);

        M_0_315 = roundPlus(((M_0_315_i + M_0_315_2_i) / 2), 2);
        MC_0_315 = roundPlus((100 - M_0_315), 2);
        $("[name='p_0_315']").val(MC_0_315);

        M_0_071 = roundPlus(((M_0_071_i + M_0_071_2_i) / 2), 2);
        MC_0_071 = roundPlus((100 - M_0_071), 2);
        $("[name='p_0_071']").val(MC_0_071);


        MC125 = 100 - M_1_25_i;
        MC125_2 = 100 - M_1_25_2_i;

        let M_1_25_diff;
        if (MC125 > MC125_2) {
            M_1_25_diff = MC125 - MC125_2;
        } else {
            M_1_25_diff = MC125_2 - MC125;
        }


        MC0315 = MC125 - M_0_315_i;
        MC0315_2 = MC125_2 - M_0_315_2_i;

        let M_0_315_diff;
        if (MC0315 > MC0315_2) {
            M_0_315_diff = MC0315 - MC0315_2;
        } else {
            M_0_315_diff = MC0315_2 - MC0315;
        }


        MC0071 = MC0315 - M_0_071_i;
        MC0071_2 = MC0315_2 - M_0_071_2_i;

        let M_0_071_diff;
        if (MC0071 > MC0071_2) {
            M_0_071_diff = MC0071 - MC0071_2;
        } else {
            M_0_071_diff = MC0071_2 - MC0071;
        }


        if (M_1_25_diff > 2) {
            //alert('Разница между определениями содержания частиц порошка мельче 1.25 мм превышает 2% и равна ' + roundPlus(M_1_25_diff, 2) + "%. Необходимо повторить испытание");
        }

        if (M_0_315_diff > 2) {
            //alert('Разница между определениями содержания частиц порошка мельче 0.315 мм превышает 2% и равна ' + roundPlus(M_0_315_diff, 2) + "%. Необходимо повторить испытание");
        }

        if (M_0_071_diff > 2) {
            //alert('Разница между определениями содержания частиц порошка мельче 0.071 мм превышает 2% и равна ' + roundPlus(M_0_071_diff, 2) + "%. Необходимо повторить испытание");
        }
    });
});